In [10]:
import pandas as pd
import numpy as np
df1=pd.DataFrame({'A':pd.Timestamp('20130102'),'B':np.array([3]*4,dtype='int32'),
'C':pd.Categorical(['Male','Female','Male','Female'])})
print(df1)

           A  B       C
0 2013-01-02  3    Male
1 2013-01-02  3  Female
2 2013-01-02  3    Male
3 2013-01-02  3  Female

In [11]:
df1.shape

(4, 3)

In [15]:
df1.tail()
df1.head()

           A  B       C
0 2013-01-02  3    Male
1 2013-01-02  3  Female
2 2013-01-02  3    Male
3 2013-01-02  3  Female

In [19]:
df1.describe()

         B
count  4.0
mean   3.0
std    0.0
min    3.0
25%    3.0
50%    3.0
75%    3.0
max    3.0

In [20]:
dates=pd.date_range('20130101', periods=100)
df = pd.DataFrame(np.random.randn(100,4), index=dates, columns=list('ABCD'))

In [21]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10', '2013-01-11', '2013-01-12',
               '2013-01-13', '2013-01-14', '2013-01-15', '2013-01-16',
               '2013-01-17', '2013-01-18', '2013-01-19', '2013-01-20',
               '2013-01-21', '2013-01-22', '2013-01-23', '2013-01-24',
               '2013-01-25', '2013-01-26', '2013-01-27', '2013-01-28',
               '2013-01-29', '2013-01-30', '2013-01-31', '2013-02-01',
               '2013-02-02', '2013-02-03', '2013-02-04', '2013-02-05',
               '2013-02-06', '2013-02-07', '2013-02-08', '2013-02-09',
               '2013-02-10', '2013-02-11', '2013-02-12', '2013-02-13',
               '2013-02-14', '2013-02-15', '2013-02-16', '2013-02-17',
               '2013-02-18', '2013-02-19', '2013-02-20', '2013-02-21',
               '2013-02-22', '2013-02-23', '2013-02-24', '2013-02-25',
               '2013-02-26', '2013-02-27', '2013-02-28', '2013-03-01',
               '2013-03-02', '2013-03-03', '2013-03-04', '2013-03-05',
               '2013-03-06', '2013-03-07', '2013-03-08', '2013-03-09',
               '2013-03-10', '2013-03-11', '2013-03-12', '2013-03-13',
               '2013-03-14', '2013-03-15', '2013-03-16', '2013-03-17',
               '2013-03-18', '2013-03-19', '2013-03-20', '2013-03-21',
               '2013-03-22', '2013-03-23', '2013-03-24', '2013-03-25',
               '2013-03-26', '2013-03-27', '2013-03-28', '2013-03-29',
               '2013-03-30', '2013-03-31', '2013-04-01', '2013-04-02',
               '2013-04-03', '2013-04-04', '2013-04-05', '2013-04-06',
               '2013-04-07', '2013-04-08', '2013-04-09', '2013-04-10'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.245755 -0.476814 -2.815544 -0.422622
2013-01-02 -1.310112  1.526883 -0.535173  1.252991
2013-01-03 -0.255013 -0.217833 -1.378519  0.391184
2013-01-04  1.609512  0.448781  1.380687  0.715581
2013-01-05 -0.910462  1.956755 -2.175678 -0.083761
...              ...       ...       ...       ...
2013-04-06 -1.363034 -0.619711 -0.871351 -1.463367
2013-04-07  1.044716 -0.408717  0.413839 -0.469130
2013-04-08  0.452632 -0.003033  1.970288 -0.706198
2013-04-09  1.659426 -0.640438 -0.139371 -0.869247
2013-04-10  0.910391  0.741497  1.748908 -0.646464

[100 rows x 4 columns]

In [26]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -0.422622 -2.815544 -0.476814 -0.245755
2013-01-05 -0.083761 -2.175678  1.956755 -0.910462
2013-02-08 -1.627278 -2.171060 -0.826266 -0.045392
2013-03-25  0.505081 -1.765590  0.019208  0.793264
2013-02-27 -0.439497 -1.738838 -0.347191 -0.719346
...              ...       ...       ...       ...
2013-01-16 -0.001920  1.676543  0.932683  0.059019
2013-04-10 -0.646464  1.748908  0.741497  0.910391
2013-03-26  1.585015  1.870667  1.075534 -0.305785
2013-04-08 -0.706198  1.970288 -0.003033  0.452632
2013-03-11 -0.265052  2.938295 -0.185613 -1.040436

[100 rows x 4 columns]

In [28]:
df['20130105':'20130110']

                   A         B         C         D
2013-01-05 -0.083761 -2.175678  1.956755 -0.910462
2013-01-06  0.346930  0.634117  0.131058  0.163284
2013-01-07  1.282448  0.074286  0.144877  0.689090
2013-01-08  1.803111 -0.077987 -0.892378  0.088601
2013-01-09  0.664761  1.519301  0.143835  0.409834
2013-01-10 -0.331262  0.094993 -0.164609 -1.025334

In [29]:
df.drop ('A', axis =1, inplace=True)

In [30]:
df

                   B         C         D
2013-01-01 -2.815544 -0.476814 -0.245755
2013-01-02 -0.535173  1.526883 -1.310112
2013-01-03 -1.378519 -0.217833 -0.255013
2013-01-04  1.380687  0.448781  1.609512
2013-01-05 -2.175678  1.956755 -0.910462
...              ...       ...       ...
2013-04-06 -0.871351 -0.619711 -1.363034
2013-04-07  0.413839 -0.408717  1.044716
2013-04-08  1.970288 -0.003033  0.452632
2013-04-09 -0.139371 -0.640438  1.659426
2013-04-10  1.748908  0.741497  0.910391

[100 rows x 3 columns]